Masmiseim36/nxpSDK/devices/MIMXRT735S/iar/startup_MIMXRT735S_cm33_core0.s
        PUBWEAK Reserved73_IRQHandler
        PUBWEAK Reserved73_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved73_IRQHandler
        LDR     R0, =Reserved73_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved74_IRQHandler
        PUBWEAK Reserved74_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved74_IRQHandler
        LDR     R0, =Reserved74_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH0_IRQHandler
        PUBWEAK EDMA0_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH0_IRQHandler
        LDR     R0, =EDMA0_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH1_IRQHandler
        PUBWEAK EDMA0_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH1_IRQHandler
        LDR     R0, =EDMA0_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH2_IRQHandler
        PUBWEAK EDMA0_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH2_IRQHandler
        LDR     R0, =EDMA0_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH3_IRQHandler
        PUBWEAK EDMA0_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH3_IRQHandler
        LDR     R0, =EDMA0_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH4_IRQHandler
        PUBWEAK EDMA0_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH4_IRQHandler
        LDR     R0, =EDMA0_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH5_IRQHandler
        PUBWEAK EDMA0_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH5_IRQHandler
        LDR     R0, =EDMA0_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH6_IRQHandler
        PUBWEAK EDMA0_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH6_IRQHandler
        LDR     R0, =EDMA0_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH7_IRQHandler
        PUBWEAK EDMA0_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH7_IRQHandler
        LDR     R0, =EDMA0_CH7_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH8_IRQHandler
        PUBWEAK EDMA0_CH8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH8_IRQHandler
        LDR     R0, =EDMA0_CH8_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH9_IRQHandler
        PUBWEAK EDMA0_CH9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH9_IRQHandler
        LDR     R0, =EDMA0_CH9_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH10_IRQHandler
        PUBWEAK EDMA0_CH10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH10_IRQHandler
        LDR     R0, =EDMA0_CH10_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH11_IRQHandler
        PUBWEAK EDMA0_CH11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH11_IRQHandler
        LDR     R0, =EDMA0_CH11_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH12_IRQHandler
        PUBWEAK EDMA0_CH12_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH12_IRQHandler
        LDR     R0, =EDMA0_CH12_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH13_IRQHandler
        PUBWEAK EDMA0_CH13_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH13_IRQHandler
        LDR     R0, =EDMA0_CH13_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH14_IRQHandler
        PUBWEAK EDMA0_CH14_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH14_IRQHandler
        LDR     R0, =EDMA0_CH14_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA0_CH15_IRQHandler
        PUBWEAK EDMA0_CH15_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA0_CH15_IRQHandler
        LDR     R0, =EDMA0_CH15_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH0_IRQHandler
        PUBWEAK EDMA1_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH0_IRQHandler
        LDR     R0, =EDMA1_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH1_IRQHandler
        PUBWEAK EDMA1_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH1_IRQHandler
        LDR     R0, =EDMA1_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH2_IRQHandler
        PUBWEAK EDMA1_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH2_IRQHandler
        LDR     R0, =EDMA1_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH3_IRQHandler
        PUBWEAK EDMA1_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH3_IRQHandler
        LDR     R0, =EDMA1_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH4_IRQHandler
        PUBWEAK EDMA1_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH4_IRQHandler
        LDR     R0, =EDMA1_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH5_IRQHandler
        PUBWEAK EDMA1_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH5_IRQHandler
        LDR     R0, =EDMA1_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH6_IRQHandler
        PUBWEAK EDMA1_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH6_IRQHandler
        LDR     R0, =EDMA1_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH7_IRQHandler
        PUBWEAK EDMA1_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH7_IRQHandler
        LDR     R0, =EDMA1_CH7_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH8_IRQHandler
        PUBWEAK EDMA1_CH8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH8_IRQHandler
        LDR     R0, =EDMA1_CH8_DriverIRQHandler
        BX      R0

        PUBWEAK EDMA1_CH9_IRQHandler
        PUBWEAK EDMA1_CH9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
EDMA1_CH9_IRQHandler
        LDR     R0, =EDMA1_CH9_DriverIRQHandler
        BX      R0

